#include <iostream>
#include <math.h>		// pow() and sqrt()
#include <string>		// for fullWidth board display
#include <ctime>		// for time loop function
#include <conio.h>		// _getch() <= to read input without enter "ENTER" key
#include <algorithm>	// for max and min function
#include "Position.h"
#include "Hero.h"
#include "Creature.h"
#include "Trigger.h"
#include<Windows.h>
#include <stdexcept>
#include<exception>
using  std::runtime_error;
//************************************************************
// Defining location on the board
//************************************************************

void SetColor(int color = 7)
{
  HANDLE hConsole;
  hConsole = GetStdHandle(STD_OUTPUT_HANDLE);
  SetConsoleTextAttribute(hConsole,color);
}

int cmd_x = 0, cmd_y = 0;
bool susume = false;


// Check whether the location is a valid one i.e. not a wall
bool isPositionValid(Position& loc);



// clip algroithm
float clip(float n, float minimun, float maximum);

// Check whether two position is close enough?A?Q?? call-by-referce ?N?p??o????V?^??
bool canSee(Position cPos, Position hPos, Position& pos2);



// Constant values
const std::string GWALL = "牆";
const std::string GNOTHING = "　";

const int GWIDTH = 15;
const int GHEIGHT = 15;
const double gTimeLog = 0.033;

// Distance
const int gDistance = 4;

// ?嚙稿??x?s???????
std::string** gBoard;

// ?w?q?????J???O?P?????}?Cindex
enum ValidInput
{
	EW = 0,
	ES = 1,
	EA = 2,
	ED = 3,
	ESPACE = 4,
	EESC = 5,
	EC = 6,
	EY = 7,
	INVALID,
};

Eren gEren;
Hero** heros;
Creature** creatures;
Mikasa gMikasa;
Cart_Titan gCart;
Jaw_Titan gJaw;
War_Hammer_Titan gWar;
War_Hammer_Titan_realPlace gWarReal;
Giant gGiant;
Item** items;
Syringe gSyringe;
int map;
int creatureNum;
int itemNum;
int num = gGiant.count;

Beast_Titan gBeast;
Levi gLevi;
Giant Levi1Giant(4,1);
Giant Levi2Giant(1,5);
Giant Levi3Giant(9,7);
Giant Levi4Giant(11,2);
Giant Levi5Giant(13,5);
Giant Levi6Giant(12,13);
Giant Levi7Giant(2,12);

Erwin gErwin;
Kitchen kitchen1(10,1);
Kitchen kitchen2(11,1);
Kitchen kitchen3(12,1);
Kitchen kitchen4(13,1);
Kitchen kitchen5(13,2);
Kitchen kitchen6(13,3);

Table table1(9,4);
Table table2(10,4);

Carpet carpet1(10,7);
Carpet carpet2(11,7);
Carpet carpet3(12,7);
Carpet carpet4(10,8);
Carpet carpet5(11,8);
Carpet carpet6(12,8);

Sofa sofa1(3,7);
Sofa sofa2(4,7);
Sofa sofa3(3,8);
Sofa sofa4(4,8);

Torch torch1(1,1);
Torch torch2(1,2);
Torch torch3(2,1);
Torch torch4(2,2);
Torch torch5(12,12);
Torch torch6(12,13);
Torch torch7(13,12);
Torch torch8(13,13);

Book book1(6,2);
Book book2(1,11);
Book book3(6,12);


// function declare

void keyUpdate(bool key[]);

bool isPositionValid(Position& loc);


void fillBoard();

void draw(void);

void drawInfo(void);


void update(bool key[]);

bool endGame1 = false;
bool endGame2 = false;
bool endGame3 = false;

int cmd_position = 0;

void pos(int x, int y) {
	int a = x;
	int b = y;

	while (1) {
		if (b >= 18 && b <= 19) {
			if (2 <= a && a <= 24) {
				cmd_position = 1;
				break;
			}
			if (33 <= a && a <= 57) {
				cmd_position = 2;
				break;
			}
			if (63 <= a && a <= 86) {
				cmd_position = 3;
				break;
			}
			if (93 <= a && a <= 116) {
				cmd_position = 4;
				break;
			}
		}
		else if (b >= 24 && b <= 25) {
			if (2 <= a && a <= 24) {
				cmd_position = 5;
				break;
			}
			if (33 <= a && a <= 57) {
				cmd_position = 6;
				break;
			}
			if (63 <= a && a <= 86) {
				cmd_position = 7;
				break;
			}
			if (93 <= a && a <= 116) {
				cmd_position = 8;
				break;
			}
		}
		else {

		}
	}
	//std::cout << position;
}

void chooseCorrect(int position) {
	int a = position;
	if (a == 3) {
		system("cls");
		susume = true;
		map = 1;
	}
	else if (a == 5)
	{
		system("cls");
		susume = true;
		map = 2;
	}
	else if (a == 8)
	{
		system("cls");
		susume = true;
		map = 3;
	}
	else {
		system("cls"); 
		std::wcout << R"(
                                                                       ...
                                                                     ;::::;
                                                                   ;::::; :;
                                                                 ;:::::'   :;
                                                                ;:::::;     ;.
                      .-.                                      ,:::::'       ;           OOO\
                     /aa \_                                    ::::::;       ;          OOOOO\
                   __\-  / )	             .-.               ;:::::;       ;         OOOOOOOO
         .-.      (__/    /                _/oo \             ,;::::::;     ;'         / OOOOOOO
       _/ ..\       /     \               ( \v  /__         ;:::::::::`. ,,,;.        /  / DOOOOOO
      ( \  u/__    /       \__             \/   ___)      .';:::::::::::::::::;,     /  /     DOOOO
       \    \__)   \_.-._._   )  .-.       /     \       ,::::::;::::::;;;;::::;,   /  /        DOOO
       /     \             `-`  / ee\_    /       \_    ;`::::::`'::::::;;;::::: ,#/  /          DOOO
    __/       \               __\  o/ )   \_.-.__   )   :`:::::::`;::::::;;::: ;::#  /            DOOO
   (   _._.-._/              (___   \/           '-'    ::`:::::::`;:::::::: ;::::# /              DOO
    '-'                        /     \                  `:`:::::::`;:::::: ;::::::#/               DOO
                             _/       \                  :::`:::::::`;; ;:::::::::##                OO
                            (   __.-._/                  ::::`:::::::`;::::::::;:::#                OO
                                                         `:::::`::::::::::::;'`:;::#                O
                                                           `:::::`::::::::;' /  / `:#
                                                            ::::::`:::::;'  /  /   `#


)";
		srand(time(NULL));

		/* 產生 [1 , 4] 的整數亂數 */
		int x = rand() % (4) + 1;

		
		if (x == 1) {
			std::cout << "溫馨提醒：你已被艾主席踩扁\n\n";
		}
		else if (x == 2) {
			std::cout << "溫馨提醒：你已被慌亂逃跑的人群踩死\n\n";
		}
		else if (x == 3) {
			std::cout << "溫馨提醒：你已被路過的調查兵團打死\n\n";
		}
		else if (x == 4) {
			std::cout << "溫馨提醒：你已被倒塌的房屋壓死\n\n";
		}

		

		system("pause");
		system("color 0F"); 
	}
}

void title() {
	system("cls");
	std::cout << "\t\t\t\t\t演講就快開始了!快找個位子坐下吧!\n";
	std::wcout << R"(
                            __..----------------------------------------------..__
            _______ __..--""______________________________________________________""--..__ _______
           |_______:_________________:_________________:_________________:________________:_______|
           |       |                                                                      |      |
 __________|       |                                .-""-.                                |      |_________________
/    /     |       |                               :      :                               |      |       \         \
    /      |       |                               |______|                               |      |        \         \
   /_______|       |                               |      |                               |      |_________\ ________\
   |       |      _:_______________________________|      |_______________________________:_     |          |         |
   |       |    .'                                                                          `.   |          |         |
   |       /I_.'  I'-..-''-..-''-..-''-..-''-..-''-..-''-..-''-..-''-..-''-..-''-..-''-..-'I  '-.I\         |         |
___|______//|____/|________________________________________________________________________|\____i\\________|_________|
         [.________________________________________________________________________________________.]
         |__________________________________________________________________________________________|
)";
	std::wcout << R"(
  ________________________       ________________________      ________________________      ________________________
 /__.__________________.__\     /__.__________________.__\    /__.__________________.__\    /__.__________________.__\
/__.____________________.__\   /__.____________________.__\  /__.____________________.__\  /__.____________________.__\
  | |_|              | ||        | |_|              |_| |      | |_|              |_| |       | |_|              |_| |
  |_|                |_|         |_|                  |_|      |_|                  |_|       |_|                  |_|

  ________________________       ________________________      ________________________      ________________________
 /__.__________________.__\     /__.__________________.__\    /__.__________________.__\    /__.__________________.__\
/__.____________________.__\   /__.____________________.__\  /__.____________________.__\  /__.____________________.__\
  | |_|              | ||        | |_|              |_| |      | |_|              |_| |       | |_|              |_| |
  |_|                |_|         |_|                  |_|      |_|                  |_|       |_|                  |_|

)";

	if (endGame1 == true)
	{
		std::cout << "已通過艾倫關" << std::endl;
	}

	if (endGame2 == true)
	{
		std::cout << "已通過兵長關" << std::endl;
	}

	if (endGame3 == true)
	{
		std::cout << "已通過團長關" << std::endl;
	}


	//system("PAUSE");
	HANDLE h = GetStdHandle(STD_INPUT_HANDLE);
	/*if (h == NULL)
	{
		return false;
	}*/

	DWORD cNumRead, fdwMode, i;
	fdwMode = ENABLE_EXTENDED_FLAGS | ENABLE_WINDOW_INPUT | ENABLE_MOUSE_INPUT;
	if (!SetConsoleMode(h, fdwMode))
		fprintf(stderr, "%s\n", "SetConsoleMode");
	DWORD cc;
	INPUT_RECORD irec;
	KEY_EVENT_RECORD key;
	MOUSE_EVENT_RECORD mouse;
	for (; ; )
	{
		ReadConsoleInput(h, &irec, 1, &cc);
		//mouse input
		if (irec.EventType == MOUSE_EVENT)
		{
			mouse = (MOUSE_EVENT_RECORD&)irec.Event;
			if (mouse.dwButtonState == FROM_LEFT_1ST_BUTTON_PRESSED)
			{
				//std::cout << "mouse left click" << std::endl;
				//std::cout << "   mouse pos:" << mouse.dwMousePosition.X << " " << mouse.dwMousePosition.Y << std::endl;
				cmd_x = mouse.dwMousePosition.X;
				cmd_y = mouse.dwMousePosition.Y;
				pos(cmd_x, cmd_y);
				break;
				/*case RIGHTMOST_BUTTON_PRESSED:
					std::cout << "mouse right click" << std::endl;
					std::cout << "   mouse pos:" << mouse.dwMousePosition.X << " " << mouse.dwMousePosition.Y << std::endl;
					break;
				case FROM_LEFT_2ND_BUTTON_PRESSED:
					std::cout << "mouse middle click" << std::endl;
					std::cout << "   mouse pos:" << mouse.dwMousePosition.X << " " << mouse.dwMousePosition.Y << std::endl;
					break;*/
					/*default:
						break;*/
			}

			/*switch (mouse.dwEventFlags)
			{
			case DOUBLE_CLICK:
				std::cout << "mouse DOUBLE_CLICK" << std::endl;
				break;
			case MOUSE_WHEELED:
				std::cout << "mouse MOUSE_WHEELED:" << HIWORD(mouse.dwButtonState) << std::endl;
				break;
			default:
				break;
			}*/
		}
		/*else if (irec.EventType == KEY_EVENT)
		{
			key = (KEY_EVENT_RECORD&)irec.Event;
			if (key.bKeyDown)
			{
				if (key.wVirtualKeyCode == VK_F1)
				{
					std::cout << "F1" << std::endl;
				}
				else
				{
					std::cout << "key: " << key.uChar.AsciiChar
						<< " code:  " << key.wVirtualKeyCode << std::endl;
				}

			}
		}*/
	}

}


//******************************************************************
// Intent:	Main function of game
// Pre:		None
// Post:	None
//==================================================================
int main(int argc, char** argv)
{

BEGIN:




	if (endGame1 == true && endGame2 == true && endGame3 == true)
	{
		system("CLS");
		system("color F0"); 
		std::wcout << R"(
																																			
																																			
																																			
																																			
																																			
							---=-.                                           ..         .=*=                       .                         
						--.    -=:                                   .-: .*#.         :##=             .:-=.   -#-                         
					.----=.        =-                                  ##: =#= .        :##=          :=-::#=   .##   ..                     
				.=               :+              .-.       -*=     .##==*#:*= ..     .##*:---.   .-:  :*=    =#-  =#.                     
				--       :-       :+            -##+      .##+++  .=##..##:*+=:  ::  .*#+::-#*       =+:    :#+  :#:                      
				.---.      =-+        =-           .*##=    -=#*.    .=##-=##:.     *-:=-..   -*.     :+:      *#: .*-                       
			.+:           -#-       =#.           .*##: :-.-#+..    -###-##.     .#+:  .-=::+.     :*=:     -#= .*=                        
			:-     .:      :*.       -+=:           -++*::.=#*=*#..==*+=-##:     :#- .--...=       :+##.   .#*  ++                         
			=.      +.      :+.      :- :=-       :---*=#+-=#*+=*=-.=*: .*#+ .-: .*:   -===:         +#+   *#. -#.                         
			.--.      :=       :+.     --   .+.   .-: .*::#.-*#+=*: .--*--:+##-+#.    .=#==:           -#*  =*: .*=                          
		.--   ..     -=       *+-    +.    .+      :+..##..+#++.  .++*-==:####- -. -=#*#-            .##.:+:  :*.                          
		--.    :*.     -=.    .+=..:-++.     +     ==::=#+.-*#-..::+=+*==  -###===  :**#*    .        .##..    ..                           
		+.      =+.     .-+.   ---=:--.==   :=   .+**+..-   *#**+=:*:+*.--  :+*+:  .*=*#*   -:   .*:  .#*                                   
		=: -     :*:      =:   ++:.:-   =: -=    -:--    .-+##.    -.=#-          .*+ *##*=-.    .##-.=*.:-. .=-                            
		:= =:     .-+:     -. -*. :+:   =.=-     :-.   .==::#*    .--:#:          --  .===.       :+**=       .                             
		*..+.      :*=-: .--=*.    +.  :=.    .=.         =#=    -.  +-                                                                    
		-= .+:      .+ +.   :+.    -::-:     -#*-         =#-                                                                              
		.*-  -=.     . --    .==-:-=.-       -*##*=-::....*-. .                 .:--:                                                      
		:-==  .-=-.  .=.  :      . .=.        .-*#########**+=:          :---::.    :=                                                     
		:- ::    ..---    =       .=.             .......           .:-=+=---------. .=                                                    
		.+                +      --                                --.         :-:-:  =   .:------:-::::::::::.                            
		+.              :=    -=.                                     .---:::: .::  .=  =-.                .:+:                           
		.+.             =. .-+.                                   :---:                 .         .::::::.::.                             
			.+:            -  .==-.                               .--:                               .:::-:--:.                              
			-+=:..   .:.     =.-+                             :=:                                          .:--:                           
			.-= .:----: .:    .:=*.                          .-:    ...                                         .--.                        
			.=.+         :-     :=.=.                        --  :-=+=:.                                            --                       
		.=  +         --    :+  .-                      :=.:=-==-                                              ::.+                       
		+.  =:        -:   -=  .-+                     =--=:.=-                                                 +=                        
		=:   :=        .- .=:  .= +                    ===..=-               .:-    -.:=:                         --                       
		-:     +.         :=.   =. +                   ++. :=.              .+. +.   --  :--      .                 :=                      
		--      .+       .=:    =.  +                  .:  -=         ..    -=   .+   .+    .=-    :+:                :=                     
	:=        :=     -=.   .=.   +                     =-         .+.   =-     :+   --     .=:   .*=.               --                    
	=.          .  .=:    .=.    =.                   =-        ..+.   +:       :+.  +:      :=   :+=:               =.                   
	:*-.          --     .-      :-                  =- .+.    --=:  .+:         .=- .+:      .=.  =:=.              .+                   
		+.--------:-+.     -:       .=                 -- :*.    .+.*  .+.            .=-.+:      .*=-.+.+               -:                  
		.+.     ....:.   .-.         +                :+ :=+     -:=:  +:               .--*-  :==*==- =::=              .+                  
		:==.           --           =:              .+ .==:     +.*  +:                  :.=***=-.  -: + +. =.      --   =                  
		=:.==:       :-.            :=              +. +.+     .+:+ --                  =++*+**=.   .=:=.:- :*. :.   :=  ::                 
		.+   :---:  :.               +             := .=.*     -:--.+                .-+*=++-=.=#*=-=*+=- + :=+..+    -= .=                 
		--                          =:            +. =:.+     + +:+.                 -*=++:.+##*+.  .: - = :-.+ *   . +:.-                 
		+.                         .=           .+  + .+  .+ + +=+.....             +==. -##-  ++    += =:-: =.*.=-=+-+-.                 
		:=                          +           :=  + .+  := * +==-+*#+=+++-.           ====:::#-    *+ :-+. .=+#.  .#*:                  
			=.                         =:          .= .=  *  .= *:=+:   .==:=-+*+:        .+ -*:=#-    :*. .=+   **=    =#=                  
			.+                         :=           +.:-  *   * .+:=:  .-==+++=:==.          .++=.   .+*   .=+   ++#.   =*+                  
			--                         +           .+:-  +.  +. --=..**==*=-+#+*=+                .=#=    :=-   *.:. =:+=+                  
			+.                        =:           .=-  :=  :=  +.-::  +:.:.* ::--           :=++*=.     ==.  :*+.  .+#.+                  
			.+                        :=             .   *.  +.  *.    *. :*.   .+            ..         :-   +--- ..%= +                  
			--                        +.                --  .+  =. .+ .==-. .:  +                           --..+  -*::+                  
				+.                       :=                 =:  -- =: =++=:..:=*: .-                          --  .* :#. ..                  
				.+                        +.                 -=. =-#:  :==**+-.   .                                *:*+                      
				:=                       .+                  .--.-#:             ..                               *- :                      
				=-                       --                      =*-:           .*.                              *                         
				+.                       =:.                    .#.             :#+:. -:    :-==:               *                         
				.+                        +=                     *+               ::-.  .-+=-. .:*-             +                         
					-=                        =-                    -#-           :--=---===:       +*-           .+                         
					+.                        -+.                   +#:          =+ ....:-=+=#==#+**%#.          -:                         
					.+                         .+:                   +#.         *= .=+%=+-*.#=.=**#*#=          +                          
					:=                          -+.                  +*.        #*#*+=+=%-*-**.=+*#-#%.      ..:-  ..                      
					=:                           -=.                 +*.      .%%%#+*+*#*++*==+-#++:#=     .-.- .-:=                      
						+.                           .==.                +*      .%%#%*#+*+#=**:*+-#+#.+:    :- .  :+ *.                     
						.+                             .==.               -*.     #+*#%***#==--::::..=-*.  .=:     -- :+                     
						--                              .==.              :+:    ++-=+:: .           .+  -=.      +:  -+                    
						---                                .==.              ==.  .*.       :-==-----:: .+:        *    ==                   
						=-                                   -=:             -*-  :*=-:.-==:.        .==         -=     +-                  
						=-                                    -=-.           .+*-   .--.          .==.          *.     .*.                 
						-=                                     .==.           .=+=:            :==.           -=       .*                 
							-+                                      .-=:           ..:==--.   .:==:             .*         +:                
							:+.                                       .==.      -:      :=====:                +:         -=                
							.+.                                         :--.   *    *  .=-                   -=          :=                
							.+:                                           :::.*    =-   :=-                :*.====.     =:                
								==                                             -+    .*.    :+.             .*==.  .*.   .+                 
*-     :                       -+.                                           -=     .*.    .=-            +*-     .*  .+.                 
.+:    *                        .+.                                          =:   .  :*.     :-:         :%-       -+-+.                  
	.*.  :*                         .=-                                         =:  ==+  :*.                ==         +==                   
.=:-.  :#-=:               ::-::.   -=                                        +:  = =-  :*:                           .                    
	-=-..-#:=-         .==+*--:::-=+*=..+:                                      +.  =  *:  .+=.                                              
.-.= =+##++.       .==.           .-*+:=-                                     =:  +  .*:   :=+:.                                           
:=* +*+*:.       -=.                -#=-+.                                   -+  +   .*:    .:==--:                                       
.=: -*#+-=:    .+:     .:            .**.+-                                   *:.+    .*-  =                                              
--:-#+-*      -+.      =#:.=++-       .**.-=.                                 .==:      =+:+.                                             
:+:  :. =.    ==       :*=+ -=:#+       :#+ .+:                                           .-:                                              
.=   .#.      -+      :+*:.%.*#+-#+       *#   -=.                                                                                          
	.#.:-.  .#.      =*-: #=#=+=+#::     -#.   .=-                                                                                         
	.::#=.+=  =+     .+=-==:%#+%*.+*#+:    =#      :=:                                                                                       
.+ -*. -+. +-    :*+=:##=#::#* :*#-#   .#-        :-:                                                                                     
=-:=.      *:   -*:   -+*+.    :*=:*   +=            .                                                                                    
==-*=-=.   *=   :#+-. :=.:=:    : +- .+-                                                                                                  
	.*== =-   -*.  *+     .+-:#++*#**+ :+:                                                                                                   
:+.=*..    .*+.:##.  . .+#****##%*%+=                                                                                                     
-= ++*+      -**#%%#*####***######=#.                                                                                                      
:: .#-*:     =+**+#*-:=%%+=+==+*%%%*:                                                                                                       
	-+++:    -+ +**%#. .##+--+--**+#-                                                                                                        
.*: --.-. =*=*+##-   -###- -**+=#                                                                                                         
*: -*-:    :-:  :      ..  :#+*=+                                                                                                         
--:=-.                      =##*==                                                                                                         
	.                          ::                                                                                                            
																																			
																																			
																																																			
														

)";
		system("pause");
		system("color 0F"); 
		return 0;
	}
	susume = false;
	gEren.setPos(13, 13);
	gLevi.setPos(7, 13);

	while (1) {
		if (susume == false) {
			title();
			chooseCorrect(cmd_position);
		}
		else if (susume == true) {
			break;
		}
	}



	bool gKeyState[8];

	heros = new Hero * [3];
	heros[0] = &gEren;
	heros[1] = &gLevi;
	heros[2] = &gErwin;

	// Setup dungeon
	fillBoard();
//BEGIN:
	system("CLS");

	if (map == 1)
	{
		std::cout << "你將作為艾倫，打敗戰槌，找出她真身的藏身之處吧！" << std::endl;
		std::cout << "通關條件：在攜帶米卡莎及捕獲顎巨人的前提下，找出戰槌的藏身之處" << std::endl;
		std::cout << "人物簡介：" << std::endl;
		std::cout << "艾倫 - 生命10，3條命" << std::endl;
		std::cout << "米卡莎 - 艾倫遇到後會自動攜帶" << std::endl;
		std::cout << "車力 - 範圍攻擊（兩格內傷害2）" << std::endl;
		std::cout << "顎巨人 - 傷害3，在顎巨人一格內按下C鍵捕捉（50%機率成功）" << std::endl;
		std::cout << "普通巨人 - 傷害1，碰到繁殖（最多4隻）" << std::endl;
		std::cout << "針筒 - 攜帶針筒觸碰普通巨人可以減少一隻" << std::endl;
		std::cout << "戰槌 - 傷害10，只能在固定範圍活動" << std::endl;
		std::cout << "戰槌藏身之處 - 在戰槌的附近，碰到後會顯示" << std::endl;


		system("pause");

		endGame1 = false;
	}

	if (map == 2)
	{
		std::cout << "你將作為兵長，打敗吉克，消滅在場所有巨人！" << std::endl;
		std::cout << "通關條件：消滅在場所有巨人後，找到吉克" << std::endl;
		std::cout << "人物簡介：" << std::endl;
		std::cout << "兵長 - 生命20，3條命" << std::endl;
		std::cout << "吉克 - 在消滅所有巨人前沒辦法動他" << std::endl;

		system("pause");
		endGame2 = false;
	}

	if(map == 3)
	{
		std::cout << "在艾爾文團長不存在的夢裡" << std::endl;
		std::cout << "他無數次想擁有這一天..." << std::endl;
		std::cout << "你將代替他，找到巨人之謎的真相\n\n" << std::endl;
		std::cout << "你必須找到通往地下室的門" << std::endl;
		std::cout << "速速妹！速速妹！\n" << std::endl;

		std::cout << "通關條件：找到地下室的門" << std::endl;

		
		system("pause");
		endGame3 = false;
	}
	
	system("CLS");

	if (map == 1)
	{
		creatures = new Creature * [10];
		creatures[0] = &gMikasa;
		creatures[1] = &gCart;
		creatures[2] = &gJaw;
		creatures[3] = &gWarReal;
		creatures[4] = &gWar;
		creatures[5] = &gGiant;
		gGiant.count = 0;
		num = 0;
		creatureNum = 6;
		items = new Item * [1];
		items[0] = &gSyringe;
		itemNum = 1;
	}

	if(map == 2)
	{
		creatures = new Creature*[15];
		creatures[0] = &gBeast;
		creatures[1] = &Levi1Giant;
		creatures[2] = &Levi2Giant;
		creatures[3] = &Levi3Giant;
		creatures[4] = &Levi4Giant;
		creatures[5] = &Levi5Giant;
		creatures[6] = &Levi6Giant;
		creatures[7] = &Levi7Giant;
		creatureNum = 8;
		gGiant.count = 0;
		itemNum = 0;
	}
	
	if(map == 3)
	{
		creatureNum = 0;
		itemNum = 29;
		items = new Item*[29];
		items[0] = &torch1;
		items[1] = &torch2;
		items[2] = &torch3;
		items[3] = &torch4;
		items[4] = &torch5;
		items[5] = &torch6;
		items[6] = &torch7;
		items[7] = &torch8;
		items[8] = &sofa1;
		items[9] = &sofa2;
		items[10] = &sofa3;
		items[11] = &sofa4;
		items[12] = &carpet1;
		items[13] = &carpet2;
		items[14] = &carpet3;
		items[15] = &carpet4;
		items[16] = &carpet5;
		items[17] = &carpet6;
		items[18] = &table1;
		items[19] = &table2;
		items[20] = &kitchen1;
		items[21] = &kitchen2;
		items[22] = &kitchen3;
		items[23] = &kitchen4;
		items[24] = &kitchen5;
		items[25] = &kitchen6;
		items[26] = &book1;
		items[27] = &book2;
		items[28] = &book3;
	}
	// Draw the bord and information
	draw();
	std::cout << std::endl;
	drawInfo();

	// Variable for game loop
	clock_t startT, endT;
	startT = clock();
	endT = clock();

	// Get the press key
	keyUpdate(gKeyState);

	// Run the game loop
	while (!gKeyState[ValidInput::EESC]) {
		// Compute the time lap
		double timeFrame = (double)(endT - startT) / CLOCKS_PER_SEC;

		// Execute the game loop
		if (timeFrame >= gTimeLog) {
			update(gKeyState);
			startT = clock();
		}

		// Update the key
		keyUpdate(gKeyState);
		endT = clock();

		
		if (endGame1 == true && map == 1)
		{
			
			system("color F0"); 
			std::wcout << R"(
                                                                                                                        
                            ---                                                   -##:   +%%%                           
                        :::.:-==-                                                %##########%%%%                        
                       ::-==:::==--:                                        +:  +%%%%%%#%%###%#%%#.                     
                      :::::===---++==+                                        #*#%%%%%%%%%%%##%%%%%##                   
                     ::------=++==+**#                                      .%%##%%%%%%%%%%%%#%%%%###*                  
                    ::::=+=====++++**#                                     % %%%*#%%%%%%%%%##%%%#%%###*                 
                   ::::::-++**+++**###                                    ##=#%#+*%%#%%%%%##%%%%%%%%%#                  
                  .:--=---:-+*****######                           *########%%%%+#%%%%%%###%%%***%%%###*                
                 .--==+**+=-:=**#*######                                +##########%%%%#####++==*%%%#%%%                
                ::--=+*#****+++*#+ +**                             :##########%%##%%%%%##+-+=-**#%%#%@+%                
               ::--==+********+.                                    *#############%##%#*-::--+#%%%#*%@ %                
               :--==+****+=                                         ######******####%#+=:==-+#%#**=#%%#                 
               -==++***+=                       :::::--=++=====+++==++*####****++**#*=+*=+*#**#+-=*%%%=                 
              :-==++++==                      :.......::-++*+--=+++=----=++**#+*++*=-*%%%##+===**+#%+%                  
              --=++++==                     :..........:::-+*+=--===------=*#****+=-+*%%%%%%*==+##%                     
             ::-=++++=-                   ::.........:::-+****#*--=++==++***+==*++---==#%%%%%@%#%@                      
             ::-+++====                  :............:::--=**##*++********+=====*+---+-+##%%+  @                       
             ::=+++*++=                 :...............:::::=**#*++##%###*+========---:-=+#*  @%                       
             :-+++***++-              .::...............::---=+**######%%#*+**++++=+-::::-***                           
            .:=++*+***+=.            .:::-::::-::......::-==--=+***###%%#**#***#**##*:::-*#*                            
            :-=+***+**+*+        ----++===---:::::....:::--+*+--+**##########*#*####*+==+##.                            
           :--=+***++*##*+    *=----=+*+=---:::::::::::---=****++****########*#####*######                              
           :--=+**#++####*+ **=-::::----==++==------====+**#####******######*###########                                
          ::-=+***+.+#####***+-:::::::.::::=+**++++++**###########**##########**########                                
          ::-=+***+-*#*####**=........::::-=+*##*+==+++***######**#*##########***#****##                                
          ::-=+**#+#*#*####*+:.......:::-=+*#####%##*+++*##%#******###########**########                                
          ::-=+=***#*######*=.......::=+**#############%%%%*++******##########**########*+==           *+*              
          ::-=+=+*##**#####*-:::::::-+**###  *#%#####%%###*++==++**#######*##*#########++++++***       #**+**           
           :-.++**#***#####*------==+*##:     #######%%%#*+=--=+*++********###***#####++++++++++****=  **+**+*          
           :=-++*##########*===+++**#         ########%%#*+++++***************  *##%%#*+++++++*******##+*#++#           
            -++**########++******             *####*###%#**--++*++++****+*-       -###**+++++********#**=+#*            
            -++**#######%+:*#                 ****#*#####*++=-+++******                               #*#*              
             =**#########                     **+*##***###***++***###*                                                  
                                              +**+*+*######***#######*                                                  
                                              ++*****######**#####*****                                                 
                                              ****+########*#***#*******                                                
                                                             

)";
			system("pause");
			system("color 0F"); 
			goto BEGIN;

		}

		else if (endGame2 == true && map == 2)
		{
			system("color F0"); 
			std::wcout << R"(


                                                                                                                                 
                                                                 .......                                                         
                                                          .:----------::-:::..                                                   
                                                       .:-=-=+***********++==--::                                                
                                            .--==---::-=-=*#######*************+=--:.                                            
                                         .-***#####*+==*#################*********+=-::                                          
                                       -+#*###############################*##********=--:.                                       
                                    .=*#######################################*********=---.                                     
                                  .=#############################################********+==-.                                   
                                .-################%################################********+--:                                  
                               :+################%##################################********+=--.                                
                             :+#%###############%%######################################******=--.                               
                            =*#%###############%%#######################################*******==-:                              
                          :*#%%###############%%#########################################*+****+==--                             
                         -*#%%%###############%%#####################################*+***+=*+++=++-:                            
                       .=#%%%%###############%%#######################################+=***==+===***=-                           
                      .=#%%%%%##############%%######################################***==++=====+****--                          
                      +%%%%%%%##############%###############################*#******+**+=====+==******=:                         
                     =#%%%%%%##############################################*++*==***+==+===++**=+*##**+=.                        
                    :#%%%%%%%%#%#################################+##**##***=+=====*+=+*+==+***#*+####**=-                        
                    +#%%%%%%%%%%##########################*######*=++=*##++===+==++*****+=*#####*#####*+=                        
                   -*%%%%%%%%%%%%######################*###*####*#*+==+###*=*++#+=*######**###########**-                        
                   *#%%%%%%%%%%%%%%###############%####**##*########+=*####*##**#**#####################:                        
                  :#%%%%%%%%%%%%%%%%%%##########%%%%%###*############*##################################:                        
                  +#%%%%%%%%%%%%%%%%%%%%#####%%%%%%%%%########%########################################*-                        
                 .*%%%%%%%%%%%%%%%%%%%%%%%##%%%%%%%%%%########%########################################*-                        
                 :#%%%%%%%%%%%%%%%###%##%%#####+==+*+###%#####%%########%########%####################+=:                        
                 -#%%%%%%%%%%%%%%%**++++++++=:.....-++##%%####%%##%#####%%#######%%###################-:                         
                 =#%#%%%%%%%%%%%##**++++++++........=+###%###+%%##%%#####%%##%###%%###################--                         
                 -+-+%%%%%%%%%%%%***+*+++++-........:+*###%##+#%%#%%#%%##%%%#%%##%%%#################*::                         
                    +%%%%%%%%%%%%****+++++=::........=*###%#*+#%%#%#%#%%#%#%##%##%%%####%#%##########+:                          
                    *%%%%%%%%%%%#****+++++-:::.......-*#*#%#*+*%%%%*%%%%#%*%#+*%#%%%%##%%#%#%########=:                          
                    +#%%%%%%%%%%#****++++=::::.......-+#*#%#+++%%%%*#%#%%%+*%+=%#%%%%##%%%%#%########::                          
                    +##%%%%%%%%%*****++++-::::.......:+#=*%#-++#%%%=*%*#%%-+%==%%%%%%##%%%%#%%#%#%###:                           
                    =*+%%#%%%%%%*****++++:::::.......:+*=*#*:+=**%#-+%**%%--#==#%%%%%##%#%%%%%%%#%##+:                           
                    :+=%#*%%#%%%*****++++::::::......-*==*#+:+:*=#+:+#++##::*:+#%%#%%#%#%%%%%%%%%%%#=.                           
                    .=:%*=%%*%%%#*****++=::::::......=+.=+#::=.+-#::+#-+##::=:=*##*#%###=.:*%%%%%%%*:                            
                     -.#+:#%*%%#%*****+++::::::.....:-=.=+*.-:.--*.:=*.=+*:--...##**###::++-%%%%#%#=                             
                       =-.*%+%%++*********=-:::-...-::::+=-.:...=+====:==+......*-=*#+.-+++=%%#%+#+                              
                       :: =#=%%+ ++********###*+...+:-:=+*=++****+===-::-:......+.:**:-+::+=%##%##-                              
                        . .#.+++ .+**######**#**:..:-=*******+-..::::::.-:......-..**-*+::-=%*%==+                               
                           =.:=.  -***#+++*#%##*+:....=++**+++=+++++**+++**=:.....:*=:*+:.=####.+.                               
                           .. -    ******+::=--*++....:=+++++=-::.:-=: :+=........:*.+*=.=**#*-.:                                
                                   -**********++++:.....-==-.:::::::::-:..........-==+-.=****:                                   
                                    *+****+**+++++:...............................=.-..:***+:                                    
                                    :=********++++:...............................:....*+*+:                                     
                                     .=*******+++*:.................................:=+-++:.                                     
                                      :+******++++.:..............................-+-....=-.                                     
                                       =******++++::..............................*.......*-:...                                 
                                        +******+*-::.............................-=...... ****=====-:                            
                                        .+*****+*+====-..........................+-.......+=+*#**+++==:                          
                                         .+****++++*++=:........................+=:...... ++==%###***+=-                         
                                           -+****+++++........................:++=.......-+===%######**=-                        
                                            .=+***+++=:......................-+++-....:======+%#%%%###**=:                       
                                              :+***++++===--:..............-*+=+=...-========+%#%%%%####*=                       
                                              :+****+++:....:............=**++++-.-==========+%#%%%######*-.                     
                                             =%###**++++=:............:+#**+++++=+============##%%%#######*=--:..                
                                           .=%%%%%%#*++++:.........:=*#**++++*++==============##%############*+++=-:.            
                                         .=*%%%%%%%%#*+++.......:=*###**+++++================+#################****++=-.         
                                        :#%%%%%%%%###%*++....-=*####**++*++=++=============*######################****+=.        
                                      .=#%%%%%%%%%%######***#######**+*++++++++========++*#*##########################*+:        
                                      *%%%%%%%%%%%#%####====+##**#***++++++++++++===+**#*##############################*=        
                                    .+%%%%%%%%%%%%#%###+===+=++===****++++++++++=+**####################################+:       
                                    -#%%%%%%%%%%%##%###===+==+====*####++++++++**#######################################*=-:.    
                                   :*%%%%%%%%%%%%%####+==+==+=====#####++++**#*##########################################*++===--
                                   *%%%%%%%%%%%%%%###*===+=+======#####+**#################%##############################*****++
                                  =%%%%%%%%%%%%%%%##*+==+==+=====-####################%%######################################***
                                 .#%%%%%%%%%%%%%%%##+===+========+############%%%%%%#############################################
                                 -%%%%%%%%%%%%%%%%%++===+====+*#########%%%%%%%%#################################################
                                 =%%%%%%%%%%%%%%%%*=======+*######%%%%%%%%%%#####################################################
                                 +%%%%%%%%%%%%%%%%=====+######%%%%%%%%%%#########################################################
                                 *%%%%%%%%%%%%%%%#==+*%%#%%%%%%%%%%##############################################################
                                .#%%%%%%%%%%%%%%%**%%%%%%%%%%%###################################################################
                                .#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%######################################****+++++++++++
                                :%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%##########################################%%##**#######*****+++
                                -%%%%%%%%%%%%%%%%%%%%%%%%%%%#######################################%%%%%%######################**
                                =%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%########################%%%%%%%%%%%%############################
                                =%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#################################
                                +%%%%%%%%**#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%######################################
                               .*%%%%%%%*+++%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#############################################
                               -%%%%%%%%++++%#%%%%%%%%%%%%%%%%%%%%%%%%%%%%#######################################################
                               *%%%%%%%%+++*%#%%%%%%%%%%%%%%%%###################################################################
                              .#%%%%%%%%#**%%#%%%%%%%%%%%%#######################################################################
                              -%%%%%%%%%%%%%#%%%%%%%%%%%%%%%#####################################################################
                             .*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%####################################################################
                             -#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%###################################################################
                             *%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#################################################################
                            :#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%################################################################
                            -#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%###############################################################
                            +%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%##############################################################
                           :#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#############################################################
                           =%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%############################################################
                           *%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%###########################################################
                          :#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%##########################################################
                          =%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%########################################################
                         .*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#######################################################


                                                                                  
                                              
                                                             

)";
			system("pause");
			system("color 0F"); 
			goto BEGIN;
		}
		else if (endGame3 == true && map == 3)
		{
		system("color F0");
		std::cout << "謝謝你，我終於能夠去地下室看看" << std::endl;
		std::wcout << R"(

                     -===*###############################*************+++==-::::::::--=++******+**+++:.    
                     ===+##################################**********+=-:::::::::::::::::-++*******++=:.   
                    :==+*################################***********=:::::::::::::::::::::::-=++*****++-   
                    -===**###################################******+=::::::::::::::::::::::::::-++++**+=:  
                   .==++++#########################%%%%%%%###******+=:::::::::::::::::::::::::::::-++++-.  
                   :===++*###################%%%%%%%%%%%%###*******++::::::::::::::::::::::::::::::-+++:   
                   -=+=**################%%%%%%%%%%%%%%%%##*******++=::::::::::::::::::::::::::::::-++-.   
                   ==*+###############%%%%%%%%%%%%%%%%%%###*****++=::::::::::::::::::::::::::::::::-+-     
                  .+=*#############+=+%%%%%%%%%%%%%%%%##*******++-:::::::::::::::::::::::::::::::::-:      
                  :++############%%#=-+%%%%%%%%%%%%##**********+-::::::::::::::::::::::::::::::::::-       
                  -++###########%%##+=-#%%%%%%%%##***************+++=--::::::::::::::::::::::::::::-       
                  :*+##########%%###*==+#%%%%%##***************++++***#***+==-::::::::::::::::::::-:       
                  :**##############%#=-=#%%%%#*****************+++++++**#######**+=:::::::::::::::=.       
                  .**################*==#%%%##*****************++++****++*##%#######*+=::::::::::.+.       
                   +*########%#####%##=+#%%%#*********-:-=+++********+=====*#%%%%%###**+:::::::::.+        
                   =*########%%###%%%#**%%%###*******+::::::--=***+++*###*+=*#%%%%%%%##+::::=+=-:.+        
                   -*######%##%##%%%####%%%##*********-::::::::-++:.:-*#######%#%%%%%%#=:::=####*+*        
                   :*######%%###%%%%%###%%###*********=::::::::::--::===+=+-+*#####***=:::=#%%%%##-        
                   .*#####%%%###%%%%####%%#####*******+-:::::::::::::-++++::++*++++++=:::+#%%##*+.         
                    *#####%%%###%%%%####%%#####********+::::::::::::::-++++***+++++++=::+##*=-+:           
                    +####%%%%####%%%%###########********=::::::::::::::-=++++++=++++++-:=####+-            
                    =###%%%%%######%%%#########%#*******+=::::::::::::::::::::::++++++=::*+*==             
                    -###%%%%#########%###########********+-::::::::::::::::::::=++++++-::=-:=              
                    -##%%%%%##################*##*********+::::::::::::::::::-++++++++-::+-=:              
                    -#%%%%%%##################*###********+-::::::::::::::::-+++++++++:::::=               
                    -%%%%%%######%%%##########**##********+:::::::::::::::::=+++++++++:::::=               
                    -%%%%#########%%%%#########***********=:::::::::::::::::=+++++++++::-::.               
                    +%%%#############%#########**********+::::::::::::::::::=**+++++++::::.                
                   .%%%########################*********+-:::::::::::::::::-+++++++++=::::                 
                   +############################********-:::::::::::::::::::=+*****++-::.:                 
                  :#############################*******=::::::::::::::::::::::=+**+*+=:::.                 
                  +*############################******=::::::::::::::::::::::::=++==++-=:                  
     .:--=-:.    :*##############################****=::::::::::::::::::::::::::-::::.:                    
:.   *#%%%%%%%#****###################%##########***+-::::::::--::::::::::::::::::::.-                     
%%%#**#%%%%%%%%%%*##################%##%##########**--::::::::::-------==-----:::::.:                      
%%%%%*#%%%%%%%%%%%%%%%%#############%###%%########**=-::::::::::::::::::::-=++==-:..                       
%%%%#*#%%%%%%%%%%%%%%%%%%%##%#######%####%%#######**+--:::::::::::==-:::::::::--::.                        
%%%%##%%%%%%%%%%%%%%%%%%%%%%%#######%%####%%%######**--:::::::::::=++++=-::::::::.                         
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#####%%#####%%%#####**+--:::::::::::-=++***++=:::.                          
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#########%%%%%####**+-::::::::::::::-=++==-::.                           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#######%%%%%####**=-::::::::::::::::::::::                            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#####**#%%%%###**--:::::::::::::::::::-.                            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%####*+*#%%%##**--::::::::::::::::::-                             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%###**++#%%%#**--::::::::::::::::=                              
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%###**==*%%%#*--::::::::::::::-.                              
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%###*#*++%%%%#+--::::::::::::.                               
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%##%%%%##%%%%%##*++===--::-.                                
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#%%%%%#*#%%%%%%%#****###**-.                               
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#*++%%%%%**+=-:-+####*+-:                            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%###+%%%%#****++::-####**==                           

	)";
		system("pause");
		system("color 0F");
		goto BEGIN;
		}


	}
	
	try
	{
		system("pause");
		return 0;
	}
	catch (runtime_error& error)
	{
		return 0;
	}
}

//******************************************************************
// Intent:	Updaye keyin status
// Pre:		Inputted key
// Post:	none
//==================================================================
void keyUpdate(bool key[])
//==================================================================
{
	for (int i = 0; i < ValidInput::INVALID; i++) {
		key[i] = false;
	}
	char input = _getch();
	switch (input) {
	case 'w':
		key[ValidInput::EW] = true;
		break;
	case 's':
		key[ValidInput::ES] = true;
		break;
	case 'a':
		key[ValidInput::EA] = true;
		break;
	case 'd':
		key[ValidInput::ED] = true;
		break;
	case ' ':
		key[ValidInput::ESPACE] = true;
		break;
	case 27:
		key[ValidInput::EESC] = true;
		break;
	case 'c':
		key[ValidInput::EC] = true;
	case 'y':
		key[ValidInput::EY] = true;
	default:
		break;
	}
}

//******************************************************************
// Intent:	Make sure object is in valid position
// Pre:		Position
// Post:	Whether the position is in canvas
//==================================================================
bool isPositionValid(Position& pos)
//==================================================================
{
	// Check whether it is an empty space
	if (gBoard[pos.y][pos.x] == GNOTHING) {
		return true;
	}
	return false;
}

//******************************************************************
// Intent:	Make sure value is in valid range
// Pre:		three floats
// Post:	valid translated float
//==================================================================
float clip(float n, float minimun, float maximum)
//==================================================================
{
	return max(minimun, min(n, maximum));
}

//******************************************************************
//
// * ?Q?? call-by-referce ?N?p??o????V?^??
//==================================================================
//******************************************************************
// Intent:	Check if two positions are within seeable range
// Pre:		Two pisitions and a directional value
// Post:	Whether could be seen
//==================================================================
bool canSee(Position cPos, Position hPos, Position& dir)
//==================================================================
{
	// the dir_x and dir_y value are call-by-refernce
	dir.x = (int)clip((float)(hPos.x - cPos.x), -1.f, 1.f); // clip the value between -1 ~ 1
	dir.y = (int)clip((float)(hPos.y - cPos.y), -1.f, 1.f);
	int count = 0;
	do {
		// spot the target position
		if (cPos.x + dir.x * count == hPos.x &&
			cPos.y + dir.y * count == hPos.y) {
			return true;
		}
		count++;
	} while (count < gDistance); // check the range in 4 units
	return false;
}

//==================================================================
//******************************************************************
// Intent:	Set up the board
// Pre:		None
// Post:	None (Board already set)
//==================================================================


//******************************************************************
// Intent:	Fill the board with GWALL
// Pre:		None
// Post:	Canvas filled with GWALL
//==================================================================
void fillBoard()
//==================================================================
{
	gBoard = new std::string * [GHEIGHT];
	for (int i = 0; i < GHEIGHT; i++) {
		gBoard[i] = new std::string[GWIDTH];
		for (int j = 0; j < GWIDTH; j++) {
			gBoard[i][j] = GWALL;
		}
	}

	for (int i = 1; i < GHEIGHT - 1; i++) {
		for (int j = 1; j < GWIDTH - 1; j++) {
			gBoard[i][j] = GNOTHING;
		}
	}

	if (map == 1)
	{
		int arr[41][2]  = {{1,7},{2,7},{3,7},{4,7},{6,1},{6,2},{6,3},{6,4},{6,5},{6,6},{7,3},{10,3},{11,3},{12,3},{12,4},{12,5},{12,6},{12,7},{12,8},{11,8},{10,8},{9,8},{8,8},{8,7},{8,6}
		,{8,9},{8,10},{8,11},{8,12},{7,12},{5,12},{4,12},{3,12},{2 ,12},{2,11},{2,10},{2,9},{9,12},{10,12},{11,12},{12,12}};
		for(int i = 0; i < 41; i++)
		{
			gBoard[arr[i][1]][arr[i][0]] = GWALL;
		}
		
	}

	if(map == 2)
	{
		int arr[57][2]={{5,1},{6,1},{2,2},{8,2},{2,3},{7,3},{8,3},{9,3},{1,4},{2,4},{3,4},{4,4},{3,5},{4,5},{7,5},{8,5},{9,5},{4,6},{6,6},{10,6},{11,6},
		{8,7},{2,8},{5,8},{6,8},{8,8},{11,8},{12,8},{13,8},{2,9},{3,9},{2,10},{5,10},{6,10},{7,10},{10,10},{11,10},{12,10},{8,11},{4,12},{6,12},{7,12},{8,12},{10,12},
		{11,12},{12,12},{1,13},{3,13},{6,13},{10,13},{6,5},{10,5},{10,8},{10,9},{7,11},{4,13}};
		for(int i = 0; i < 57; i++){
			gBoard[arr[i][1]][arr[i][0]] = GWALL;
		}

	}

	
	if(map == 3)
	{
		int arr[36][2]={{5,1},{6,1},{10,1},{11,1},{10,2},{1,2},{2,2},{2,3},{3,3},{6,3},{7,3},{2,4},{7,4},{12,6},{1,7},{2,7},{12,7},{12,7},{10,9},{3,10},
		{10,10},{11,10},{12,10},{3,11},{6,11},{12,11},{1,12},{2,12},{3,12},{6,12},{7,12},{10,12},{6,13},{10,13},{11,13},{12,13}};
		for(int i = 0; i < 36; i++){
			gBoard[arr[i][1]][arr[i][0]] = GWALL;
		}

	}

}


//******************************************************************
// Intent:	Draw the board
// Pre:		None
// Post:	Output drawn board
//==================================================================
void draw()
//==================================================================
{
	// Add the hero into the board
	std::string drawBoard[GHEIGHT][GWIDTH];

	for (int i = 0; i < GHEIGHT; i++) {
		for (int j = 0; j < GWIDTH; j++) {
			drawBoard[i][j] = gBoard[i][j];
		}
	}

	// Update the hero information
	if (map == 1)
	{
		Position h = heros[0]->getPos();
		//SetColor(30);
		drawBoard[h.y][h.x] = heros[0]->getIcon();
		for (int i = 0; i < creatureNum; i++)
		{
			if (i == 0 && gMikasa.withEren == true || i == 2 && gJaw.caught == true)
			{
				continue;
			}
			Position c = creatures[i]->getPos();
			//SetColor(11);
			drawBoard[c.y][c.x] = creatures[i]->getIcon();
		}
		for (int i = 0; i < itemNum; i++)
		{
			Position it = items[i]->getPos();
			//SetColor(88);
			drawBoard[it.y][it.x] = items[i]->getIcon();
			if (it.y == h.y && it.x == h.x)
			{
				gSyringe.killGiant = 1;
			}
		}

		for (int i = 0; i < creatureNum; i++)
		{
			if (i == 0)
			{
				continue;
			}
			if (i == 2)
			{
				if(abs(creatures[i]->getPos().x - heros[0]->getPos().x) == 0 && abs(creatures[i]->getPos().y - heros[0]->getPos().y) == 0)
				{
					gEren.damage(creatures[i]->attack);
				}
			}
			if (i == 1)
			{
				if (abs(creatures[i]->getPos().x - heros[0]->getPos().x) <= 2 && abs(creatures[i]->getPos().y - heros[0]->getPos().y) <= 2)
				{
					gEren.damage(creatures[i]->attack);
				}
				continue;
			}
			if (i == 3)
			{
				if (abs(creatures[i]->getPos().x - heros[0]->getPos().x) == 0 && abs(creatures[i]->getPos().y - heros[0]->getPos().y) == 0)
				{
					if (gMikasa.withEren == true && gJaw.caught == true)
					{
						endGame1 = true;
						system("CLS");
						std::cout << "恭喜你吃下了戰槌!" << std::endl;
						system("pause");
						break;
					}
				}
				continue;
			}
			if (abs(creatures[i]->getPos().x - heros[0]->getPos().x) == 0 && abs(creatures[i]->getPos().y - heros[0]->getPos().y) == 0)
			{
				gEren.damage(creatures[i]->attack);
			}
			if (i != 4)
			{
				if (abs(creatures[i]->getPos().x - heros[0]->getPos().x) == 0 && abs(creatures[i]->getPos().y - heros[0]->getPos().y) == 0)
				{
					if (gSyringe.killGiant == 1)
					{
						gGiant.count -= 1;
						creatureNum -= 1;
						gSyringe.killGiant = 0;
					}
					else
					{
						if (gGiant.count < 4)
						{
							creatures[creatureNum] = new Giant(4, 5);
							gGiant.count += 1;
							creatureNum += 1;
						}
					}
				}
				
			}

		}


	}

	if (map == 2)
	{
		Position h = heros[1]->getPos();
		drawBoard[h.y][h.x] = heros[1]->getIcon();
		for (int i = 0; i < creatureNum; i++)
		{
			Position c = creatures[i]->getPos();
			drawBoard[c.y][c.x] = creatures[i]->getIcon();
		}

		for (int i = 0; i < creatureNum; i++)
		{
			if (i == 0)
			{
				if (abs(creatures[i]->getPos().x - heros[1]->getPos().x) == 0 && abs(creatures[i]->getPos().y - heros[1]->getPos().y) == 0)
				{
					if (creatureNum < 2)
					{
						endGame2 = true;
						system("CLS");
						std::cout << "恭喜你打贏獸巨人吉克!" << std::endl;
						system("pause");
						break;
					}
				}
				continue;
			}
			if (abs(creatures[i]->getPos().x - heros[1]->getPos().x) == 0 && abs(creatures[i]->getPos().y - heros[1]->getPos().y) == 0)
			{
				gLevi.damage(creatures[i]->attack);
				if (gGiant.count < 10)
				{
					if(creatureNum < 13)
					{
 						creatures[creatureNum] = new Giant(4, 3);
						gGiant.count += 1;
						creatureNum += 1;
					}
						
				}
			}

		}

	}

	if(map == 3)
	{
		Position h = heros[2]->getPos();
		drawBoard[h.y][h.x] = heros[2]->getIcon();
		
		for (int i = 0; i < itemNum; i++)
		{
			Position it = items[i]->getPos();
			drawBoard[it.y][it.x] = items[i]->getIcon();
			if(gErwin.burn == true)
			{
				endGame3 = true;
				system("CLS");
				std::cout << "恭喜你找到密室的門!" << std::endl;
				system("pause");
				break;
			}
		}
	}

	if (endGame1 == false && map == 1 || endGame2 == false && map == 2 || endGame3 == false && map == 3)
	{
		// Draw the board
		for (int i = 0; i < GHEIGHT; i++) {
			for (int j = 0; j < GWIDTH; j++) {
				if(drawBoard[i][j] != GWALL)
				{
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 11);
				}
				else
				{
					SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 7);
				}
				std::cout << drawBoard[i][j]; //  output
			}
			std::cout << "\n";
		}
	}
	
}

//******************************************************************
//
// * Output information
//==================================================================
void drawInfo(void)
//==================================================================
{
	if (endGame1 == false)
	{
		if (map == 1)
		{
			std::cout << "利用wasd鍵控制艾倫　" << heros[0]->getIcon() << std::endl;
			std::cout << "找出戰槌真身的藏身之處，就在戰槌附近" << std::endl;
			std::cout << "要帶著米卡莎一同前往藏身之處才能通關喔!" << std::endl;
			if (gMikasa.withEren == true)
			{
				gEren.withMikasa = true;
				std::cout << "已攜帶米卡莎" << std::endl;
			}
			if (gJaw.caught == true)
			{
				std::cout << "已捕獲顎巨人" << std::endl;
			}
			if (gSyringe.killGiant == true)
			{
				std::cout << "已獲得針筒" << std::endl;
			}
			std::cout << "HP : " << gEren.ErenHealth << std::endl;
			std::cout << "剩" << gEren.ErenHeart << "條命" << std::endl;
			std::cout << "Press ESC key to exit\n";
		}
	}

	if(endGame2 == false)
	{
		if(map == 2)
		{
			std::cout << "利用wasd鍵控制里維兵長　" << heros[0]->getIcon() << std::endl;
			std::cout << "消滅在場巨人，然後找上吉克" << std::endl;
			std::cout << "被巨人找上門巨人就會攻擊你並多一隻喔" << std::endl;
			std::cout << "在巨人旁邊使用y鍵來擊殺" << std::endl;
			if (creatureNum < 2)
			{
				std::cout << "已消滅現場巨人，去找吉克算帳吧" << std::endl;
			}
			std::cout << "HP : " << gLevi.LeviHealth << std::endl;
			std::cout << "剩" << gLevi.LeviHeart << "條命" << std::endl;
			std::cout << "Press ESC key to exit\n";
		}
	}

	if(endGame3 == false)
	{
		if(map == 3)
		{
			std::cout << "利用wasd鍵控制團長艾爾文　" << heros[0]->getIcon() << std::endl;
			std::cout << "解出密室門之所在" << std::endl;
			std::cout << "利用空格鍵來了解這個房間" << std::endl;
			std::cout << "可以用y鍵來拿取或運用可用的道具" << std::endl;
			if (gErwin.getTroch == true)
			{
				std::cout << "已攜帶火炬" << std::endl;
			}
			std::cout << "Press ESC key to exit\n";
		}
	}
}

//******************************************************************
// Intent:	Output information for game
// Pre:		None
// Post:	Information outputted
//==================================================================
void update(bool key[])
//==================================================================
{
	system("CLS");

	bool hasInput = false;
	if (key[ValidInput::EW]) {
		heros[map - 1]->move(0, -1);
		hasInput = true;
	}
	else if (key[ValidInput::ES]) {
		heros[map - 1]->move(0, 1);
		hasInput = true;
	}
	else if (key[ValidInput::EA]) {
		heros[map - 1]->move(-1, 0);
		hasInput = true;
	}
	else if (key[ValidInput::ED]) {
		heros[map - 1]->move(1, 0);
		hasInput = true;
	}
	else if (key[ValidInput::EC]) {
		if(map == 1)
		{
			if (abs(creatures[2]->getPos().x - heros[0]->getPos().x) == 1 && abs(creatures[2]->getPos().y - heros[0]->getPos().y) == 1 || abs(creatures[2]->getPos().x - heros[0]->getPos().x) == 1 && abs(creatures[2]->getPos().y - heros[0]->getPos().y) == 0 ||
			abs(creatures[2]->getPos().x - heros[0]->getPos().x) == 0 && abs(creatures[2]->getPos().y - heros[0]->getPos().y) == 1)
			{
				int random = rand();
				if (random % 2 == 1)
				{
					std::cout << "捕獲失敗" << std::endl;
					
				}
				else
				{
					std::cout << "捕獲成功" << std::endl;
					gJaw.caught = true;
				}
			}
		}
		
	}
	else if (key[ValidInput::EY]) {
		if(map == 2)
		{
			for(int i = 1; i < creatureNum ; i++)
			{
				if (abs(creatures[i]->getPos().x - heros[1]->getPos().x) == 1 && abs(creatures[i]->getPos().y - heros[1]->getPos().y) == 1 || abs(creatures[i]->getPos().x - heros[1]->getPos().x) == 1 && abs(creatures[i]->getPos().y - heros[1]->getPos().y) == 0 ||
			abs(creatures[i]->getPos().x - heros[1]->getPos().x) == 0 && abs(creatures[i]->getPos().y - heros[1]->getPos().y) == 1)
				{
					std::cout << "消滅成功" << std::endl;
					creatureNum -= 1;
					Levi1Giant.count -= 1;	
				}
			}
		}
		if(map == 3)
		{
			for(int i = 0; i < itemNum; i++)
			{
				if (abs(items[i]->getPos().x - heros[2]->getPos().x) == 1 && abs(items[i]->getPos().y - heros[2]->getPos().y) == 1 || abs(items[i]->getPos().x - heros[2]->getPos().x) == 1 && abs(items[i]->getPos().y - heros[2]->getPos().y) == 0 ||
						abs(items[i]->getPos().x - heros[2]->getPos().x) == 0 && abs(items[i]->getPos().y - heros[2]->getPos().y) == 1)
				{
					if(i <= 7)//火炬
					{
						gErwin.getTroch = true;
						std::cout << "拿起火炬" << std::endl;
						break;
					}

					if(i >= 12 && i <= 17)
					{
						if(gErwin.getTroch == true)
						{
							gErwin.burn = true;
							std::cout << "已燒毀" << std::endl;
							break;
						}
					}
				}
			}
		}
	}
	else if(key[ValidInput::ESPACE])
	{
		if(map == 3)
		{
			for(int i = 0; i < itemNum; i++)
			{
				if(i >= 0)
				{
					if (abs(items[i]->getPos().x - heros[2]->getPos().x) == 1 && abs(items[i]->getPos().y - heros[2]->getPos().y) == 1 || abs(items[i]->getPos().x - heros[2]->getPos().x) == 1 && abs(items[i]->getPos().y - heros[2]->getPos().y) == 0 ||
						abs(items[i]->getPos().x - heros[2]->getPos().x) == 0 && abs(items[i]->getPos().y - heros[2]->getPos().y) == 1)
					{
						if(i <= 7)//火炬
						{
							std::cout << "艾倫家的光線源，使用火炬解決夜晚光線不足的問題。" << std::endl;
							break;
						}
						if(i >=8 && i <= 11)//sofa
						{
							std::cout << "艾倫他爸經常會坐在這張沙發椅上用餘光瞄著某處，既期待又怕受傷害的期盼有人能燒開真相的遮羞布。" << std::endl;
							break;
						}
						if(i >= 12 && i <= 17)//地毯
						{
							std::cout << "艾倫家的地毯，與地面貼合的十分緊密。" << std::endl;
							break;
						}
						if(i >=18 && i <= 19)//桌
						{
							std::cout << "艾倫家的餐桌，上面布滿灰塵。" << std::endl;
							break;
						}
						if(i >= 20 && i <= 25)//廚房
						{
							std::cout << "艾倫家的廚房，似乎荒廢了許久。" << std::endl;
							break;
						}
						if(i == 26)//書1
						{
							std::cout << "艾倫家的書。書名:如何撒嬌" << std::endl;
							break;
						}
						if(i == 27)//書2
						{
							std::cout << "艾倫家的書，似乎是艾倫最愛的一本書。書名:火可以燒毀礙事的東西" << std::endl;
							break;
						}
						if(i == 28)//書3
						{
							std::cout << "艾倫家的書。書名:跟著月亮走" << std::endl;
							break;
						}

					}
				}
			}
		}
	}
	else {
		std::cout << "invalid input\n";
	}
	for (int i = 0; i < creatureNum; i++)
	{
		if (i == 0 && gMikasa.withEren == true || i == 2 && gJaw.caught == true)
		{
			continue;
		}
		creatures[i]->update(heros[map - 1]->getPos());
		creatures[i]->upDate(heros[map - 1]->getPos());
	}

	draw();
	std::cout << std::endl;
	drawInfo();
}
